{
  "backend/main.mo": "Main backend actor implementing user profiles, file management with blob storage, AdSense configuration with granular ad unit IDs, traffic counter, and role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting the PowerPoint to PDF conversion feature implementation across frontend components, utilities, routing, and internationalization with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, utilities, and type definitions for the PDF Vaulty application with localization and monetization features.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables for the application's design system.",
  "frontend/index.html": "HTML entry point loading CDN libraries (SheetJS, jsPDF with encryption, pdf-lib) and including Google Search Console verification meta tag.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration for all tool pages including PowerPoint to PDF, theme provider, i18n provider, traffic counter initialization, and profile setup dialog.",
  "frontend/src/components/AdSenseAd.tsx": "Reusable AdSense ad component that dynamically loads Google AdSense script, initializes ads with configurable slots and formats, and falls back to placeholder when not configured.",
  "frontend/src/components/AdSenseFooter.tsx": "Footer advertisement component that conditionally renders AdSense ads based on configuration or shows placeholder when disabled or unconfigured.",
  "frontend/src/components/AdSenseHeader.tsx": "Header advertisement component that conditionally renders AdSense ads based on configuration or shows placeholder when disabled or unconfigured.",
  "frontend/src/components/AdSenseInContent.tsx": "In-content advertisement component that conditionally renders AdSense ads based on configuration or shows placeholder when disabled or unconfigured.",
  "frontend/src/components/AdSenseSidebar.tsx": "Renders a sticky sidebar ad component that displays either an AdSense ad (when config is enabled) or a placeholder AdSpace component, hidden on mobile devices.",
  "frontend/src/components/AdSpace.tsx": "A placeholder component for advertisement spaces with configurable sizes (small, medium, large, banner) and customizable labels, displaying a dashed border box.",
  "frontend/src/components/DragAndDropFileZone.tsx": "A reusable drag-and-drop file upload zone component that validates file types, supports single or multiple file drops, and displays a visual overlay during drag operations.",
  "frontend/src/components/Footer.tsx": "Renders the application footer with three ad space placeholders, copyright information, and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header component with responsive design, authentication controls, navigation links (home, analytics, my-files, admin), theme toggle, language selector, and traffic counter.",
  "frontend/src/components/LanguageSelector.tsx": "A language selection component that renders as a dropdown menu on desktop and button list on mobile, allowing users to switch between available languages.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A modal dialog that prompts authenticated users to enter their name for profile setup, with loading states and form validation.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes, displaying sun or moon icons based on the current theme.",
  "frontend/src/components/TrafficCounter.tsx": "Displays the total number of page views with an eye icon, fetching data from the backend and formatting the count with locale-specific number formatting.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, file management (upload/delete), AdSense configuration, and traffic counter operations, all using the actor from useActor and providing toast notifications with i18n support.",
  "frontend/src/hooks/useTrafficCounter.ts": "Custom hook that automatically increments a traffic counter via the actor when the route pathname changes, tracking page views across the application.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization that manages language state (en/es), persists to localStorage, and provides translation function with parameter substitution.",
  "frontend/src/i18n/storage.ts": "Utility functions for persisting and retrieving the selected language (en/es) from localStorage with error handling and validation.",
  "frontend/src/i18n/translations.ts": "Contains all translation strings for English and Spanish, covering navigation, analytics, file management, PDF tools, authentication, and UI messages throughout the application.",
  "frontend/src/i18n/useI18n.ts": "Simple re-export hook that provides access to the I18n context for consuming translation functions and language state.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using oklch color space.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional className merging in React components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminBlogPage.tsx": "Empty file placeholder for admin blog management page.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays traffic analytics with cards showing total views, today's views, and weekly views using data from useGetTrafficCounter hook with i18n support.",
  "frontend/src/pages/BlogPage.tsx": "Empty file placeholder for blog listing page.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty file placeholder for individual blog post display page.",
  "frontend/src/pages/CompressPdfPage.tsx": "PDF compression page with drag-and-drop file upload, progress tracking, file size comparison, and download functionality, requiring authentication and showing AdSense ads.",
  "frontend/src/pages/ConvertIntoPdfPage.tsx": "Landing page displaying conversion tool options (Word, Excel, PowerPoint, Image to PDF) as clickable cards. Requires authentication and includes AdSense components.",
  "frontend/src/pages/ExcelToPdfPage.tsx": "Excel to PDF conversion page with sheet selection, orientation options, drag-and-drop file upload, and conversion progress tracking. Uses XLSX library for parsing and custom conversion utility.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section and tool cards for PDF operations (merge, split, compress, rotate, protect, convert). Displays different CTAs based on authentication status.",
  "frontend/src/pages/ImageToPdfPage.tsx": "Image to PDF converter with multi-file upload, reordering, layout customization (page size, orientation, margins, fit mode, alignment), and progress tracking during conversion.",
  "frontend/src/pages/MergePdfPage.tsx": "PDF merge tool allowing multiple PDF uploads via drag-and-drop, file reordering with up/down controls, and batch merging with progress indication.",
  "frontend/src/pages/MonetizationSettingsPage.tsx": "Admin-only page for configuring Google AdSense settings including publisher ID, ad unit IDs for different placements (header, sidebar, footer, in-content), and toggles to enable/disable each ad placement with auto-save functionality.",
  "frontend/src/pages/MyFilesPage.tsx": "Authenticated user page for managing personal files with upload, download, and delete functionality; displays file list with metadata and requires Internet Identity login.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 error page displaying a not found message with a button to navigate back to the home page.",
  "frontend/src/pages/PowerPointToPdfPage.tsx": "Authenticated page for converting PowerPoint files (PPT/PPTX) to PDF format with drag-and-drop upload, progress tracking, and download functionality; includes AdSense header and sidebar components.",
  "frontend/src/pages/ProtectPdfPage.tsx": "Authenticated page with tabbed interface for adding password protection to PDFs or removing existing passwords, featuring drag-and-drop upload, password validation, progress tracking, and AdSense components.",
  "frontend/src/pages/RotatePdfPage.tsx": "Authenticated page for rotating PDF files by selectable angles (90, 180, 270 degrees) with drag-and-drop upload, progress tracking, and automatic download of the rotated result.",
  "frontend/src/pages/SplitPdfPage.tsx": "React page component for splitting PDF files by page range or per-page mode, with drag-and-drop file upload, progress tracking, and authentication checks.",
  "frontend/src/pages/WordToPdfPage.tsx": "React page component for converting Word documents (.docx) to PDF format with file validation, progress tracking, download functionality, and authentication requirements.",
  "frontend/src/types/vendor.d.ts": "TypeScript declaration file defining global window interfaces for third-party libraries (XLSX, jsPDF, PDFLib, adsbygoogle).",
  "frontend/src/utils/compressPdf.ts": "Utility function that compresses PDF files using pdf-lib from CDN by re-saving with optimization options and object streams.",
  "frontend/src/utils/excelToPdf.ts": "Utility function that converts Excel worksheets to PDF using XLSX and jsPDF libraries, supporting sheet selection and orientation options.",
  "frontend/src/utils/imageToPdf.ts": "Utility function that converts multiple image files to a single PDF with configurable layout options including page size, orientation, margins, fit mode, and alignment.",
  "frontend/src/utils/mergePdf.ts": "Utility function that merges multiple PDF files into a single PDF document using pdf-lib, with progress tracking and file validation.",
  "frontend/src/utils/powerPointToPdf.ts": "Placeholder utility for PowerPoint to PDF conversion that validates file types but throws an error indicating server-side processing is required and not yet implemented.",
  "frontend/src/utils/protectPdf.ts": "Utility function for adding or removing password protection from PDF files using jsPDF and pdf-lib, though encryption implementation is noted as simplified/placeholder.",
  "frontend/src/utils/rotatePdf.ts": "Client-side PDF rotation utility that uses pdf-lib to rotate all pages of a PDF by 90, 180, or 270 degrees with progress tracking support.",
  "frontend/src/utils/splitPdf.ts": "PDF splitting utility using pdf-lib that supports extracting page ranges or splitting into individual pages, with validation and progress callbacks.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing and session storage utilities that work with both query strings and hash-based routing, supporting parameter persistence across navigation.",
  "frontend/src/utils/wordToPdf.ts": "Placeholder Word to PDF conversion utility that validates Word files but throws an error indicating server-side processing is required and not yet implemented.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a PDF conversion web app deployed on Internet Computer, documenting in-progress PowerPoint to PDF feature addition and recent deployment issues."
}