{
  "backend/main.mo": "Main backend actor implementing user profiles, file management with blob storage, AdSense configuration with granular ad unit IDs, traffic counter, and role-based access control (admin/user permissions) using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: restoring to Version 29 stable state with core PDF tools, and removing PowerPoint to PDF functionality that caused deployment failures in versions 30 and 31.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with TanStack Router setup (excluding PowerPoint to PDF routes), localized components, PDF tool pages, AdSense integration, and utility functions for Excel/Word/Image to PDF conversion.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with \"PDF Vaulty\" title, Google Search Console verification meta tag, and CDN scripts for SheetJS (xlsx), jsPDF with encryption, jsPDF-autotable, and pdf-lib libraries.",
  "frontend/src/App.tsx": "Main React app with ThemeProvider, I18nProvider, TanStack Router configuration for all PDF tool routes (merge, split, compress, protect, rotate, convert, Excel/Word/Image to PDF) excluding PowerPoint to PDF, traffic counter initialization, and profile setup dialog.",
  "frontend/src/components/AdSenseAd.tsx": "Reusable AdSense ad component that dynamically loads Google AdSense script, renders ins element with configurable ad slot/client/format, and falls back to AdSpace placeholder when not configured.",
  "frontend/src/components/AdSenseFooter.tsx": "Footer AdSense ad wrapper that fetches config and conditionally renders horizontal AdSenseAd with footerAdUnitId or AdSpace placeholder based on enableFooterBanner setting.",
  "frontend/src/components/AdSenseHeader.tsx": "Header AdSense ad wrapper that fetches config and conditionally renders horizontal AdSenseAd with headerAdUnitId or AdSpace placeholder based on enableHeaderBanner setting.",
  "frontend/src/components/AdSenseInContent.tsx": "In-content AdSense ad wrapper that fetches config and conditionally renders auto-format AdSenseAd with inContentAdUnitId or medium AdSpace placeholder based on enableInContentAds setting.",
  "frontend/src/components/AdSenseSidebar.tsx": "Sidebar AdSense ad wrapper (hidden on mobile, sticky on desktop) that fetches config and conditionally renders rectangle AdSenseAd with sidebarAdUnitId or medium AdSpace placeholder based on enableSidebarAds setting.",
  "frontend/src/components/AdSpace.tsx": "Placeholder component for advertisement spaces with configurable sizes (small, medium, large, banner) displaying dashed border box with \"Advertisement\" label and \"AdSense Placeholder\" text.",
  "frontend/src/components/DragAndDropFileZone.tsx": "A React component that provides drag-and-drop file upload functionality with file type validation, visual feedback overlay, and support for both single and multiple file drops.",
  "frontend/src/components/Footer.tsx": "Footer component displaying three ad space placeholders, copyright information, and a caffeine.ai attribution link with internationalization support.",
  "frontend/src/components/Header.tsx": "Main navigation header with responsive design, authentication controls, navigation links (home, analytics, my-files, admin), theme toggle, language selector, and traffic counter.",
  "frontend/src/components/LanguageSelector.tsx": "Language selection component with dropdown menu for desktop and button list for mobile, allowing users to switch between available languages.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts new users to enter their name for profile setup, with form validation and loading states during submission.",
  "frontend/src/components/ThemeToggle.tsx": "Simple button component that toggles between light and dark themes using next-themes, displaying sun/moon icons.",
  "frontend/src/components/TrafficCounter.tsx": "Displays total page views with an eye icon, fetching data from backend and formatting the number with locale-specific separators.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, file management (upload/delete), AdSense configuration, and traffic counter operations, all using the actor from useActor hook with toast notifications and i18n support.",
  "frontend/src/hooks/useTrafficCounter.ts": "Custom hook that automatically increments a traffic counter via the actor when the route pathname changes, tracking page views across the application.",
  "frontend/src/i18n/I18nProvider.tsx": "React context provider for internationalization supporting English and Spanish, providing language state, locale formatting, and a translation function with parameter substitution.",
  "frontend/src/i18n/storage.ts": "Utility functions for persisting and retrieving the selected language (en/es) from localStorage with error handling and validation.",
  "frontend/src/i18n/translations.ts": "Translation dictionary containing English and Spanish strings for all UI elements including navigation, analytics, file management, PDF tools, and common phrases.",
  "frontend/src/i18n/useI18n.ts": "Simple hook wrapper that exports the i18n context for consuming translation functionality in components.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using oklch color space.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminBlogPage.tsx": "Empty file placeholder for admin blog management functionality.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays traffic analytics with cards showing total views, today's views, and weekly views using data from the traffic counter query with i18n support.",
  "frontend/src/pages/BlogPage.tsx": "Empty file placeholder for blog listing page.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty file placeholder for individual blog post display.",
  "frontend/src/pages/CompressPdfPage.tsx": "PDF compression page with drag-and-drop file upload, progress tracking, file size comparison display, and authenticated user requirement with AdSense integration.",
  "frontend/src/pages/ConvertIntoPdfPage.tsx": "Landing page displaying three conversion tool cards (Word to PDF, Excel to PDF, Image to PDF) with authentication check and AdSense integration.",
  "frontend/src/pages/ExcelToPdfPage.tsx": "Excel to PDF conversion page with file upload, sheet selection, orientation settings, and conversion functionality using XLSX library and pdf-lib.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section and tool cards for PDF operations (merge, split, compress, rotate, protect, convert) with authentication-aware CTAs.",
  "frontend/src/pages/ImageToPdfPage.tsx": "Image to PDF conversion page supporting multiple images with drag-and-drop, reordering, layout options (page size, orientation, margins, fit mode, alignment), and conversion to PDF.",
  "frontend/src/pages/MergePdfPage.tsx": "PDF merge tool page with drag-and-drop file upload, file reordering, progress tracking, and merge functionality using pdf-lib.",
  "frontend/src/pages/MonetizationSettingsPage.tsx": "Admin-only settings page for configuring Google AdSense publisher ID, ad unit IDs for different placements (header, sidebar, footer, in-content), and toggling ad visibility with validation and auto-save.",
  "frontend/src/pages/MyFilesPage.tsx": "Displays authenticated user's uploaded files with upload, download, and delete functionality, plus links to various PDF tools (compress, merge, split, rotate, protect). Uses Internet Identity for authentication and React Query hooks for file operations.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 error page component that displays a \"Page not found\" message with a button to return home.",
  "frontend/src/pages/PowerPointToPdfPage.tsx": "Empty file with no content.",
  "frontend/src/pages/ProtectPdfPage.tsx": "Page for adding or removing password protection from PDF files with drag-and-drop upload, password confirmation fields, and progress tracking. Includes AdSense components for monetization.",
  "frontend/src/pages/RotatePdfPage.tsx": "Page for rotating PDF pages by 90, 180, or 270 degrees with drag-and-drop file upload, rotation angle selection via radio buttons, and progress tracking.",
  "frontend/src/pages/SplitPdfPage.tsx": "Page for splitting PDFs either by page range or per-page mode, with drag-and-drop upload, page count detection, and batch download of split results. Includes AdSense components.",
  "frontend/src/pages/WordToPdfPage.tsx": "Page for converting Word documents (.docx) to PDF with drag-and-drop upload, conversion progress tracking, and download functionality. Includes AdSense components.",
  "frontend/src/types/vendor.d.ts": "TypeScript declaration file defining global Window interface extensions for third-party libraries (XLSX, jsPDF, PDFLib) and adsbygoogle array.",
  "frontend/src/utils/compressPdf.ts": "Utility function that compresses PDF files using the pdf-lib library loaded from CDN, with progress callback support and error handling for file validation.",
  "frontend/src/utils/excelToPdf.ts": "Converts Excel files to PDF by reading worksheets with XLSX library, rendering selected sheets as tables with titles, and outputting via jsPDF with configurable orientation.",
  "frontend/src/utils/imageToPdf.ts": "Converts multiple image files to a multi-page PDF with configurable page size, orientation, margins, fit mode (contain/cover), and alignment options using jsPDF.",
  "frontend/src/utils/mergePdf.ts": "Merges multiple PDF files into a single PDF using pdf-lib, copying all pages from each input file with progress tracking and validation.",
  "frontend/src/utils/powerPointToPdf.ts": "Empty file with no implementation for PowerPoint to PDF conversion.",
  "frontend/src/utils/protectPdf.ts": "Adds or removes password protection from PDFs using jsPDF and pdf-lib, though encryption implementation is noted as simplified/placeholder.",
  "frontend/src/utils/rotatePdf.ts": "Rotates all pages in a PDF by 90, 180, or 270 degrees using pdf-lib, with progress tracking and validation.",
  "frontend/src/utils/splitPdf.ts": "Splits PDFs either by extracting a page range or into individual pages using pdf-lib, returning an array of blob results with generated filenames.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions for managing parameters across navigation.",
  "frontend/src/utils/wordToPdf.ts": "Placeholder for Word to PDF conversion that validates file types but throws an error indicating server-side processing is required and not yet implemented.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting PDF Vaulty application status, indicating deployment failures in versions 30-31 (PowerPoint to PDF feature) and a fix request to restore version 29 by removing PowerPoint functionality and ensuring proper canister deployment on Internet Computer blockchain."
}