{
  "backend/main.mo": "Motoko canister handling user profiles, file metadata storage, access control, and file upload/delete operations with blob support.",
  "feature_evidence.json": "Report mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing each frontend file's purpose and functionality.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point with updated title and script imports for SheetJS, jsPDF, and pdf-lib.",
  "frontend/src/App.tsx": "Main React app setting up theming, i18n, routing, and profile initialization flow.",
  "frontend/src/components/AdSpace.tsx": "Reusable placeholder component for ad slots with configurable sizes and labels.",
  "frontend/src/components/DragAndDropFileZone.tsx": "Drag‑and‑drop file input component supporting validation, single/multiple modes, and overlay feedback.",
  "frontend/src/components/Footer.tsx": "Renders a footer with three ad placeholders and a copyright section using i18n text and a referral link.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with auth handling, responsive links, language/theme controls, and a mobile menu.",
  "frontend/src/components/LanguageSelector.tsx": "Displays a language picker with mobile buttons or a desktop dropdown using i18n and stored languages.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog for entering and saving a user name, handling actor readiness and mutation status.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes and a button icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, identity restoration, and exposes context helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, admin status, files, uploads, deletions, and AdSense config with toast messages.",
  "frontend/src/i18n/I18nProvider.tsx": "Supplies i18n context with language state, translation function, and locale handling.",
  "frontend/src/i18n/storage.ts": "Handles language persistence in localStorage and exposes helpers to read and validate the stored language.",
  "frontend/src/i18n/translations.ts": "Defines all English translation strings for UI text across pages and components.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the i18n context for translation access.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminBlogPage.tsx": "Empty placeholder component for an admin blog page.",
  "frontend/src/pages/BlogPage.tsx": "Empty placeholder component for a blog listing page.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty placeholder component for a blog post detail page.",
  "frontend/src/pages/CompressPdfPage.tsx": "Implements UI and logic for selecting, validating, compressing, and downloading a PDF.",
  "frontend/src/pages/ConvertIntoPdfPage.tsx": "Displays authenticated options to convert Word, Excel, and images into PDF with navigation links.",
  "frontend/src/pages/ExcelToPdfPage.tsx": "Handles Excel upload, sheet selection, conversion settings, and conversion to PDF.",
  "frontend/src/pages/HomePage.tsx": "Renders the home landing page with hero section and links to various PDF tools.",
  "frontend/src/pages/ImageToPdfPage.tsx": "UI for uploading, ordering, and configuring images before converting them to a PDF.",
  "frontend/src/pages/MergePdfPage.tsx": "Provides PDF upload, ordering, and merging with progress tracking and download.",
  "frontend/src/pages/MonetizationSettingsPage.tsx": "Admin page for viewing and updating AdSense configuration with auto‑saving toggles.",
  "frontend/src/pages/MyFilesPage.tsx": "Authenticated user page to upload, list, download, and delete stored files.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with localized text and a link back home.",
  "frontend/src/pages/ProtectPdfPage.tsx": "UI to add or remove PDF passwords, validating input and handling processing with progress.",
  "frontend/src/pages/RotatePdfPage.tsx": "UI page allowing authenticated users to upload and rotate PDF files with progress feedback.",
  "frontend/src/pages/SplitPdfPage.tsx": "Page for splitting PDF files by range or per‑page, showing validation, progress, and downloads.",
  "frontend/src/pages/WordToPdfPage.tsx": "Handles Word‑to‑PDF conversion with validation, progress, error states, and download support.",
  "frontend/src/types/vendor.d.ts": "Global TypeScript definitions for XLSX, jsPDF, and pdf-lib libraries loaded via CDN.",
  "frontend/src/utils/compressPdf.ts": "Compresses PDF files using pdf‑lib with progress reporting and validation.",
  "frontend/src/utils/excelToPdf.ts": "Converts Excel sheets to a PDF using XLSX and jsPDF, supporting sheet selection and table rendering.",
  "frontend/src/utils/imageToPdf.ts": "Creates a multi‑page PDF from images with layout, margins, scaling, and alignment options.",
  "frontend/src/utils/mergePdf.ts": "Merges multiple PDF files into one using pdf-lib, validating inputs and reporting progress.",
  "frontend/src/utils/protectPdf.ts": "Adds or removes PDF password protection client-side using jsPDF and pdf-lib with progress updates.",
  "frontend/src/utils/rotatePdf.ts": "Rotates all pages of a PDF by 90, 180, or 270 degrees using pdf-lib and reports progress.",
  "frontend/src/utils/splitPdf.ts": "Splits a PDF into a page range or individual pages using pdf-lib, returning blobs and filenames.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/wordToPdf.ts": "Validates Word files and contains a placeholder for server-side Word-to-PDF conversion functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing branding updates, features, and current app configuration for PDF Vaulty."
}