{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore PDF Vaulty to Version 29 (Pre-PowerPoint Deployment)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore application to Version 29 state with all core PDF tools except PowerPoint conversion",
      "acceptanceCriteria": [
        "Application deploys successfully to a working canister with a valid URL",
        "All existing PDF tools function correctly (merge, split, compress, rotate, protect, convert)",
        "PowerPoint to PDF feature is removed from the conversion tools page",
        "PowerPoint to PDF route is removed from the router configuration",
        "User authentication and file management features work properly",
        "AdSense monetization and traffic counter remain functional",
        "Application is accessible at a stable URL without 'Canister ID Not Resolved' errors"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the PowerPointToPdfPage route from the TanStack Router configuration to prevent the /convert/powerpoint path from being accessible. Ensure all other tool routes (merge, split, compress, rotate, protect, word-to-pdf, excel-to-pdf, image-to-pdf) remain intact and properly registered."
        },
        {
          "path": "frontend/src/pages/ConvertIntoPdfPage.tsx",
          "operation": "modify",
          "description": "Remove the PowerPoint to PDF tool card from the conversion options grid. Keep only Word, Excel, and Image to PDF conversion options visible and navigable. Ensure the layout adjusts appropriately with three tools instead of four."
        },
        {
          "path": "frontend/src/pages/PowerPointToPdfPage.tsx",
          "operation": "delete",
          "description": "Delete the PowerPointToPdfPage component file entirely to remove all PowerPoint conversion UI from the codebase."
        },
        {
          "path": "frontend/src/utils/powerPointToPdf.ts",
          "operation": "delete",
          "description": "Delete the PowerPoint to PDF utility function file to remove all PowerPoint conversion logic from the codebase."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove all PowerPoint to PDF conversion functionality from the codebase",
      "acceptanceCriteria": [
        "PowerPointToPdfPage.tsx is removed or excluded from the build",
        "powerPointToPdf.ts utility is removed or excluded from the build",
        "PowerPoint option is removed from the ConvertIntoPdfPage tool grid",
        "No PowerPoint-related routes exist in App.tsx router configuration",
        "Application builds and deploys without PowerPoint dependencies"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PowerPointToPdfPage.tsx",
          "operation": "delete",
          "description": "Remove the PowerPointToPdfPage component that provides the PowerPoint to PDF conversion UI, including file upload, progress tracking, and download functionality."
        },
        {
          "path": "frontend/src/utils/powerPointToPdf.ts",
          "operation": "delete",
          "description": "Remove the PowerPoint to PDF conversion utility function that was causing deployment issues in versions 30 and 31."
        },
        {
          "path": "frontend/src/pages/ConvertIntoPdfPage.tsx",
          "operation": "modify",
          "description": "Remove the PowerPoint to PDF tool card from the conversion tools grid. Update the grid to display only the three remaining conversion options (Word, Excel, Image to PDF) with appropriate spacing and layout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the /convert/powerpoint route registration from the router configuration. Verify that the PowerPointToPdfPage import is removed and that all other routes (merge, split, compress, rotate, protect, word-to-pdf, excel-to-pdf, image-to-pdf, analytics, my-files, admin, monetization-settings) remain properly configured."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure deployed application is accessible at pdfvaulty-url.caffeine.xyz domain without errors",
      "acceptanceCriteria": [
        "Application deploys to a valid canister ID on the Internet Computer",
        "The pdfvaulty-url.caffeine.xyz domain properly resolves to the deployed canister",
        "Homepage loads without 'Publish or restore your Caffeine app' message",
        "No 'Canister ID Not Resolved' errors occur when accessing the site"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Verify that the HomePage renders the hero section with all tool cards (merge, split, compress, rotate, protect, convert) correctly. Ensure the 'Get Started' and 'View All Tools' CTAs function properly based on authentication state. Confirm that AdSense components (header, sidebar, footer) are properly integrated and do not block page rendering."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Verify that the Header component renders properly with navigation links (home, analytics, my-files, admin), authentication controls (login/logout), theme toggle, language selector, and traffic counter. Ensure all navigation links use correct paths and that the component does not cause rendering failures during deployment."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Verify that the useActor hook properly creates and manages the backend actor instance based on Internet Identity authentication state. Ensure the actor initialization does not cause deployment failures and that query invalidation works correctly when the actor changes."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Verify that the application entry point properly sets up React Query, Internet Identity provider, and renders the root App component without errors. Ensure all providers are correctly nested and that the application can successfully initialize during deployment."
        }
      ]
    }
  ]
}