{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PowerPoint to PDF conversion feature",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create PowerPointToPdfPage component with drag-and-drop file upload for .ppt/.pptx files",
      "acceptanceCriteria": [
        "Page accepts .ppt and .pptx file types for upload",
        "Drag-and-drop file zone validates PowerPoint file types",
        "Conversion progress tracking displays during processing",
        "Successful conversion allows user to download the resulting PDF",
        "Page requires authentication before allowing conversion",
        "AdSense ad placements match the pattern used in other conversion pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PowerPointToPdfPage.tsx",
          "operation": "create",
          "description": "Create a new page component for PowerPoint to PDF conversion. Follow the exact structure and patterns from ExcelToPdfPage.tsx and WordToPdfPage.tsx: include useInternetIdentity hook for authentication check, DragAndDropFileZone with accept prop for .ppt and .pptx files, state management for file upload/conversion progress, handleConvert function calling the powerPointToPdf utility, AdSenseHeader and AdSenseInContent components for ad placements, and internationalization using useI18n. Display conversion progress with percentage, show download button on success, and handle errors with toast notifications."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create powerPointToPdf utility function for converting PowerPoint files to PDF",
      "acceptanceCriteria": [
        "Function accepts PowerPoint file blobs as input",
        "Function validates file type is .ppt or .pptx",
        "Function provides progress callback for UI updates",
        "Function returns a PDF blob on successful conversion",
        "Function throws descriptive errors for invalid inputs or conversion failures"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/powerPointToPdf.ts",
          "operation": "create",
          "description": "Create a utility function matching the structure of excelToPdf.ts and wordToPdf.ts. Accept parameters: file (File), onProgress callback (optional). Validate file type is .ppt or .pptx using file.name.endsWith checks. Include progress tracking callbacks at key conversion steps (0%, 50%, 100%). Since PowerPoint conversion requires server-side processing like Word documents, throw a descriptive error indicating that PowerPoint to PDF conversion requires backend processing and is not yet fully implemented. Return Promise<Blob> type signature. Include comprehensive error handling with user-friendly error messages."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add PowerPoint to PDF card to ConvertIntoPdfPage grid",
      "acceptanceCriteria": [
        "Card displays appropriate icon and title for PowerPoint to PDF",
        "Card links to /tools/powerpoint-to-pdf route",
        "Card styling matches existing Word and Excel conversion cards",
        "Card is positioned logically in the grid layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ConvertIntoPdfPage.tsx",
          "operation": "modify",
          "description": "Add a new card entry to the conversion tools grid after the Excel to PDF card. Use t('tools.powerPointToPdf.title') for the title, t('tools.powerPointToPdf.description') for the description text. Set the link to='/tools/powerpoint-to-pdf'. Use an appropriate icon (FilePresentation from lucide-react or similar presentation-related icon). Match the Card component structure with CardHeader, CardTitle, CardDescription, and hover effects identical to the existing Word and Excel cards. Position the card in the grid between Excel and Image conversion options."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add /tools/powerpoint-to-pdf route to App.tsx router configuration",
      "acceptanceCriteria": [
        "Route /tools/powerpoint-to-pdf is registered in the router configuration",
        "Route lazy-loads the PowerPointToPdfPage component",
        "Route follows the same authentication and layout patterns as other tool pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route entry in the createBrowserRouter configuration for path '/tools/powerpoint-to-pdf'. Use lazy loading with React.lazy(() => import('./pages/PowerPointToPdfPage')). Position this route after the /tools/excel-to-pdf route and before /tools/image-to-pdf route in the tools section. Ensure it follows the same authentication check pattern and layout wrapper as other conversion tool routes."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add internationalization keys for PowerPoint to PDF feature in English and Spanish",
      "acceptanceCriteria": [
        "English translations added for all PowerPoint to PDF UI text",
        "Spanish translations added for all PowerPoint to PDF UI text",
        "Translation keys follow the established naming convention (e.g., tools.powerPointToPdf.*)",
        "All user-facing text in PowerPointToPdfPage uses i18n hooks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add a new 'powerPointToPdf' section under 'tools' in both 'en' and 'es' translation objects. Include keys for: title (e.g., 'PowerPoint to PDF'), description (short feature description), uploadInstruction (drag-and-drop instructions), selectFile (button text), convert (convert button), converting (progress text), success (success message), download (download button), errors.invalidFile, errors.conversionFailed, errors.notImplemented. Follow the exact naming pattern used for excelToPdf and wordToPdf sections. Ensure Spanish translations are accurate and natural."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add PowerPoint to PDF link to HomePage tool grid",
      "acceptanceCriteria": [
        "Link card appears on the homepage tool grid",
        "Card includes PowerPoint-related icon",
        "Card description clearly indicates PowerPoint to PDF conversion",
        "Card navigates to /tools/powerpoint-to-pdf when clicked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a new card to the tool grid section in HomePage. Position it logically after the Excel to PDF card and before the Image to PDF card. Use FilePresentation icon from lucide-react or similar. Set the link to='/tools/powerpoint-to-pdf'. Use t('tools.powerPointToPdf.title') for the card title and t('tools.powerPointToPdf.description') for the description text. Match the Card component structure, styling, and hover effects of existing tool cards. Ensure the card follows the same responsive grid layout pattern."
        }
      ]
    }
  ]
}