{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "PDF Vaulty - A web-based PDF tool suite for merging, compressing, converting, and protecting PDF files. The application has experienced deployment issues with versions 30 and 31 (which added PowerPoint to PDF conversion), and the user has requested to relaunch version 29 to restore a working state.",
  "architectural_notes": [
    "Application deployed on Internet Computer blockchain via Caffeine platform",
    "Custom domain pdf-vaulty.com purchased via Hostinger but not yet connected",
    "Deployment issues experienced with versions 30 and 31 showing canister ID resolution errors",
    "Version 29 being relaunched as last known stable version before deployment issues"
  ],
  "known_issues": [
    "Version 30 and 31 deployments failed - canister ID not resolving properly",
    "Old canister URL (5e6c2-5iaaa-aaaal-qnfna-cai.icp0.io) shows 'Canister ID Not Resolved' error",
    "New Caffeine domain (pdfvaulty-url.caffeine.xyz) shows 'Publish or restore' message despite live notification",
    "PowerPoint to PDF feature (version 31) deployment corrupted the live site"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-restore-the-application-to-version-29-state-which-was-the-last-stable-deployment-before-version-30-and-31-failed-this-version-should-include-all-core-pdf-tools-merge-split-compress-rotate-protect-word-to-pdf-excel-to-pdf-image-to-pdf-but-exclude-the-powerpoint-to-pdf-feature-that-caused-deployment-issues",
      "title": "Restore the application to Version 29 state, which was the last stable deployment before Version 30 and 31 failed. This version should include all core PDF tools (merge, split, compress, rotate, protect, Word to PDF, Excel to PDF, Image to PDF) but exclude the PowerPoint to PDF feature that caused deployment issues.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-all-powerpoint-to-pdf-conversion-functionality-from-the-codebase-including-the-powerpointtopdfpage-component-powerpointtopdf-utility-function-and-related-routes-since-this-feature-caused-the-deployment-failures-in-versions-30-and-31",
      "title": "Remove all PowerPoint to PDF conversion functionality from the codebase, including the PowerPointToPdfPage component, powerPointToPdf utility function, and related routes, since this feature caused the deployment failures in versions 30 and 31.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-3",
      "summary": "Ensure the deployed application is accessible at the pdfvaulty-url.caffeine.xyz domain shown in the user's screenshots, with proper canister deployment that resolves without errors.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "PDF Vaulty",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}